/* eslint-env mocha */
/* eslint-disable max-statements */
'use strict';

const assert = require('assert');

const pbql = require('./pbql');

describe('pbql.run', () => {
    beforeEach(() => {
        pbql.phoneBook.clear();
    });

    it('должен возвращать пустой массив, если контактов нет', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Покажи имя для контактов, где есть ий;'
            ),
            []
        );
    });

    it('должен находить контакты по запросу "ий"', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Создай контакт Василий;' +
                'Создай контакт Иннокентий;' +
                'Покажи имя для контактов, где есть ий;'
            ),
            [
                'Григорий',
                'Василий',
                'Иннокентий'
            ]
        );
    });

    it('должен выводить поля произвольное количество раз', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Создай контакт Василий;' +
                'Создай контакт Иннокентий;' +
                'Покажи имя и имя и имя для контактов, где есть ий;'
            ),
            [
                'Григорий;Григорий;Григорий',
                'Василий;Василий;Василий',
                'Иннокентий;Иннокентий;Иннокентий'
            ]
        );
    });

    it('должен конкатенировать результаты', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Покажи имя для контактов, где есть ий;' +
                'Покажи имя для контактов, где есть ий;'
            ),
            [
                'Григорий',
                'Григорий'
            ]
        );
    });

    it('должен удалять контакт по имени', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Удали контакт Григорий;' +
                'Покажи имя для контактов, где есть ий;'
            ),
            []
        );
    });

    it('должен добавлять телефон и почту для контакта', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Добавь телефон 5556667787 для контакта Григорий;' +
                'Добавь телефон 5556667788 и почту grisha@example.com для контакта Григорий;' +
                'Покажи имя и телефоны и почты для контактов, где есть ий;'
            ),
            [
                'Григорий;+7 (555) 666-77-87,+7 (555) 666-77-88;grisha@example.com'
            ]
        );
    });

    it('должен добавлять составные имена и уметь их искать', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий Васильевич;' +
                'Покажи имя для контактов, где есть ий Васил;'
            ),
            [
                'Григорий Васильевич'
            ]
        );
    });


    it('должен удалять телефон контакта', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Добавь телефон 5556667788 для контакта Григорий;' +
                'Удали телефон 5556667788 для контакта Григорий;' +
                'Покажи имя и телефоны для контактов, где есть ий;'
            ),
            [
                'Григорий;'
            ]
        );
    });

    it('должен удалять все контакты по запросу "ий"', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Создай контакт Василий;' +
                'Создай контакт Иннокентий;' +
                'Удали контакты, где есть ий;' +
                'Покажи имя для контактов, где есть ий;'
            ),
            []
        );
    });

    it('должен проверять регистр команд', () => {
        assert.throws(() =>
            pbql.run(
                'покажи имя для контактов, где есть Гр;'
            ),
        /at 1:1$/
        );
    });

    it('должен проверять опечатки в командах', () => {
        assert.throws(() =>
            pbql.run(
                'Покжи имя для контактов, где есть Гр;'
            ),
        /at 1:1$/
        );
    });

    it('пустая команда', () => {
        assert.deepStrictEqual(
            pbql.run(
                ''
            ),
            []
        );
    });


    it('должен показать пустой запрос', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Покажи имя для контактов, где есть ;'
            ),
            []
        );
    });

    it('должен показать с запросом который будет пуст', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Покажи имя для контактов, где есть фблфыв;'
            ),
            []
        );
    });

    it('должен Удалить ничего', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Удали контакты, где есть фблфыв;' +
                'Покажи имя для контактов, где есть ий;'
            ),
            [
                'Григорий'
            ]
        );
    });

    it('должен удалить пустой запрос', () => {
        assert.deepStrictEqual(
            pbql.run(
                'Создай контакт Григорий;' +
                'Удали контакты, где есть ;' +
                'Покажи имя для контактов, где есть ий;'

            ),
            [
                'Григорий'
            ]
        );
    });

    // it('должен правильно показывать В поиске', () => {
    //     assert.deepStrictEqual(
    //         pbql.run(
    //             'Создай контакт ИЙ;' +
    //             'Добавь почту 3 для контакта ИЙ;' +
    //             'Покажи телефоны и почты для контактов, где есть 66;' +
    //             'Удали контакты, где есть 66;'
    //         ),
    //         [
    //             '+7 (555) 666-77-88;il@66gna.com'
    //         ]
    //     );
    // });


    it('должен проверять наличие лишних пробелов', () => {
        assert.throws(() =>
            pbql.run(
                'Покажи  имя для контактов, где есть Гр;'
            ),
        /at 1:8$/
        );
    });

    it('должен проверять неправильные команды', () => {
        assert.throws(() =>
            pbql.run(
                ' '
            ),
        /at 1:1$/
        );
    });

    it('должен проверять правильность формата номеров', () => {
        assert.throws(() =>
            pbql.run(
                'Удали телефон 55566677 для контакта Григорий;'
            ),
        /at 1:15$/
        );
    });

    it('должен находить ошибку во второй команде', () => {
        assert.throws(() =>
            pbql.run(
                'Покажи имя для контактов, где есть ий;' +
                'Say my name для контактов, где есть W;'
            ),
        /at 2:1$/
        );
    });

    it('должен проверять наличие ;', () => {
        assert.throws(() =>
            pbql.run(
                'Покажи имя для контактов, где есть Гр'
            ),
        /at 1:38$/
        );
    });


    it('должен быть регистрозависимым 1', () => {
        assert.throws(() =>
            pbql.run(
                'покажи имя для контактов, где есть Гр'
            ),
        /at 1:1$/
        );
    });

    it('должен проверять наличие ; не только в конце первой строки', () => {
        assert.throws(() =>
            pbql.run(
                'Создай контакт Григорий;' +
                'Создай контакт Василий'
            ),
        /at 2:23/
        );
    });
});
